Revit 2027 API
BRepBuilder.AddLoop Method
 Creates an empty loop in a given face of the geometry being built. Other BRepBuilder methods are used to add co-edges to the loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BRepBuilderGeometryId AddLoop(
	BRepBuilderGeometryId faceId
)
Public Function AddLoop (
	faceId As BRepBuilderGeometryId
) As BRepBuilderGeometryId
public:
BRepBuilderGeometryId^ AddLoop(
	BRepBuilderGeometryId^ faceId
)
member AddLoop :
        faceId : BRepBuilderGeometryId -> BRepBuilderGeometryId
Parameters
faceId BRepBuilderGeometryId
 Id of the face to which the loop should be added. faceId was returned by a call to AddFace().
Return Value
BRepBuilderGeometryId
 An id that can be used to identify the loop while the BRepBuilder is actively building geometry (e.g., to add co-edges to the loop).
Exceptions
Exception | Condition
ArgumentException |  The supplied face id doesn't correspond to a face stored in this BRepBuilder object. -or- FinishFace() has already been called on faceId. -or- Please finish the previous loop by calling FinishLoop() before adding a new one.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This BRepBuilder object isn't accepting new data, either because it has already been used to build geometry, or because of an error. Consult the State property of the BRepBuilder object for more details.
See Also
Reference
BRepBuilder Class
Autodesk.Revit.DB Namespace